### Project: 2020Wuhan@Github/Ginchung
## File: Chongqing.py
## Run with 'python Chongqing.py'

# object 'sdct'
# Function: stores the info from official message
# Key: YYYY-MM-DD-HH
import sys

province='chongqing'

def post(page):
    r=requests.post('http://wsjkw.cq.gov.cn/yqxxyqtb/index.jhtml',data={'pageNo':page,'q':None})
    #r.encoding='unicode'
    soup = BeautifulSoup(r.text,'lxml')
    txtlst=soup.select('.newslist')
    if len(txtlst)==0:
        print('List of NewsBox is empty. Exit. ')
        exit()
    print(txtlst[0].select('li')[0])
    for i in txtlst[0].select('li'):
        dct=i.a.attrs
        href=dct['href']
        title=i.select('.span-title')[0]['title']
        if '新型冠状病毒感染的肺炎疫情情况' not in title:
            continue
        href='http://wsjkw.cq.gov.cn'+href
        print(href)

        rnew=requests.get(href)
        rnew.encoding='unicode'
        soup = BeautifulSoup(rnew.text,'lxml')
        splitter=0
        for s in soup.select('.uedit')[0].contents:
            s=s.string
            if s==None:
                continue
            #print(s)
            head=s.find('确诊病例中')
            if head==0:
                juhao=s.find('。')
                juhao=999 if juhao==-1 else juhao
                fenhao=s.find('；')
                fenhao=999 if fenhao==-1 else fenhao
                splitter=juhao if juhao<fenhao else fenhao
                print(title)
                substr=s[head+6:splitter]
                print(substr)
                break

if sys.argv[-1]=='u':
    print('Loading Update News...')
    import requests
    from bs4 import BeautifulSoup
    for p in range(2):
        post(p+1)
    exit()

print('Run "python %s.py u" to load updated data. '%province)
sdct={}
sdct['2020-01-23-00']='万州区2例、永川区2例、巫山县2例、涪陵区1例、长寿区1例、垫江县1例'
sdct['2020-01-24-00']='万州区3例、涪陵区1例、大渡口区1例、九龙坡区2例、渝北区2例、长寿区3例、永川区2例、开州区2例、垫江县2例、忠县1例、云阳县1例、奉节县1例、巫山县3例、巫溪县1例、秀山县1例、两江新区1例'
sdct['2020-01-25-00']='万州区10例、涪陵区1例、大渡口区2例、九龙坡区3例、渝北区2例、长寿区5例、合川区2例、永川区3例、璧山区2例、开州区4例、梁平区1例、城口县1例、丰都县1例、垫江县2例、忠县3例、云阳县2例、奉节县1例、巫山县3例、巫溪县2例、石柱县3例、秀山县1例、两江新区3例'
sdct['2020-01-26-00']='万州区13例，涪陵区1例，大渡口区4例，江北区2例，九龙坡区3例，渝北区4例，长寿区5例，合川区2例，永川区3例，大足区1例，璧山区2例，铜梁区1例，开州区4例，梁平区1例，城口县1例，丰都县1例，垫江县2例，忠县5例，云阳县4例，奉节县3例，巫山县3例，巫溪县3例，石柱县3例，秀山县1例，两江新区3例'.replace('，','、')
sdct['2020-01-27-00']='万州区14例、涪陵区1例、大渡口区6例、江北区3例、九龙坡区4例、渝北区5例、巴南区1例、长寿区6例、江津区2例、合川区3例、永川区3例、綦江区1例、大足区1例、璧山区3例、铜梁区1例、潼南区2例、开州区7例、梁平区1例、城口县1例、丰都县3例、垫江县4例、忠县6例、云阳县8例、奉节县3例、巫山县5例、巫溪县5例、石柱县3例、秀山县1例、两江新区7例'
sdct['2020-01-28-00']='万州区15例、黔江区1例、涪陵区1例、大渡口区6例、江北区4例、九龙坡区5例、南岸区1例、渝北区6例、巴南区1例、长寿区7例、江津区2例、合川区4例、永川区3例、綦江区2例、大足区1例、璧山区3例、铜梁区2例、潼南区2例、开州区9例、梁平区1例、城口县1例、丰都县3例、垫江县5例、忠县9例、云阳县10例、奉节县3例、巫山县5例、巫溪县5例、石柱县6例、秀山县1例、两江新区8例'
sdct['2020-01-29-00']='万州区17例、黔江区1例、涪陵区1例、渝中区1例、大渡口区6例、江北区5例、九龙坡区5例、南岸区1例、渝北区6例、巴南区1例、长寿区7例、江津区2例、合川区5例、永川区3例、綦江区4例、大足区1例、璧山区4例、铜梁区2例、潼南区2例、开州区11例、梁平区1例、城口县1例、丰都县3例、垫江县5例、忠县11例、云阳县11例、奉节县4例、巫山县5例、巫溪县5例、石柱县7例、秀山县1例、两江新区8例'
sdct['2020-01-30-00']='万州区24例、黔江区1例、涪陵区1例、渝中区2例、大渡口区6例、江北区6例、九龙坡区5例、南岸区2例、渝北区7例、巴南区1例、长寿区7例、江津区3例、合川区6例、永川区3例、綦江区4例、大足区2例、璧山区4例、铜梁区2例、潼南区2例、开州区13例、梁平区1例、武隆区1例、城口县1例、丰都县3例、垫江县5例、忠县11例、云阳县12例、奉节县4例、巫山县5例、巫溪县5例、石柱县7例、秀山县1例、两江新区8例'
sdct['2020-01-30-12']='万州区24例、黔江区1例、涪陵区1例、渝中区5例、大渡口区6例、江北区8例、九龙坡区5例、南岸区2例、渝北区8例、巴南区1例、长寿区7例、江津区3例、合川区6例、永川区3例、綦江区4例、大足区4例、璧山区4例、铜梁区2例、潼南区2例、开州区14例、梁平区2例、武隆区1例、城口县1例、丰都县3例、垫江县8例、忠县12例、云阳县13例、奉节县4例、巫山县5例、巫溪县7例、石柱县7例、秀山县1例、两江新区8例'
sdct['2020-01-31-00']='万州区28例、黔江区2例、涪陵区1例、渝中区5例、大渡口区6例、江北区8例、九龙坡区8例、南岸区3例、渝北区10例、巴南区1例、长寿区8例、江津区3例、合川区6例、永川区3例、綦江区4例、大足区4例、璧山区6例、铜梁区2例、潼南区2例、荣昌区1例、开州区16例、梁平区2例、武隆区1例、城口县1例、丰都县3例、垫江县8例、忠县12例、云阳县15例、奉节县5例、巫山县6例、巫溪县9例、石柱县7例、秀山县1例、两江新区9例'
sdct['2020-01-31-12']='万州区29例、黔江区2例、涪陵区1例、渝中区6例、大渡口区6例、江北区8例、九龙坡区8例、南岸区3例、渝北区10例、巴南区1例、长寿区9例、江津区3例、合川区6例、永川区3例、綦江区4例、大足区4例、璧山区6例、铜梁区2例、潼南区2例、荣昌区1例、开州区16例、梁平区2例、武隆区1例、城口县1例、丰都县3例、垫江县8例、忠县12例、云阳县15例、奉节县5例、巫山县6例、巫溪县10例、石柱县8例、秀山县1例、两江新区9例'
sdct['2020-02-01-00']='万州区33例、黔江区2例、涪陵区1例、渝中区7例、大渡口区6例、江北区12例、沙坪坝区2例、九龙坡区9例、南岸区3例、渝北区11例、巴南区1例、长寿区10例、江津区3例、合川区8例、永川区3例、綦江区4例、大足区4例、璧山区8例、铜梁区2例、潼南区2例、荣昌区2例、开州区16例、梁平区2例、武隆区1例、城口县1例、丰都县 4例、垫江县10例、忠县12例、云阳县17例、奉节县5例、巫山县6例、巫溪县10例、石柱县10例、秀山县1例、两江新区10例'
sdct['2020-02-01-12']='万州区39例、黔江区2例、涪陵区1例、渝中区7例、大渡口区6例、江北区12例、沙坪坝区2例、九龙坡区9例、南岸区3例、渝北区11例、巴南区1例、长寿区10例、江津区3例、合川区8例、永川区3例、綦江区4例、大足区4例、璧山区8例、铜梁区2例、潼南区2例、荣昌区2例、开州区16例、梁平区2例、武隆区1例、城口县1例、丰都县5例、垫江县11例、忠县12例、云阳县18例、奉节县5例、巫山县6例、巫溪县10例、石柱县10例、秀山县1例、两江新区10例'
sdct['2020-02-02-00']='万州区39例、黔江区2例、涪陵区1例、渝中区9例、大渡口区6例、江北区13例、沙坪坝区2例、九龙坡区11例、南岸区4例、渝北区12例、巴南区1例、长寿区10例、江津区3例、合川区8例、永川区3例、綦江区4例、大足区4例、璧山区8例、铜梁区4例、潼南区2例、荣昌区2例、开州区16例、梁平区2例、武隆区1例、城口县1例、丰都县5例、垫江县11例、忠县12例、云阳县18例、奉节县8例、巫山县6例、巫溪县11例、石柱县10例、秀山县1例、两江新区12例'
sdct['2020-02-02-12']='万州区44例、黔江区2例、涪陵区1例、渝中区9例、大渡口区6例、江北区13例、沙坪坝区2例、九龙坡区11例、南岸区4例、渝北区12例、巴南区1例、长寿区11例、江津区3例、合川区9例、永川区3例、綦江区4例、大足区4例、璧山区8例、铜梁区4例、潼南区2例、荣昌区3例、开州区16例、梁平区3例、武隆区1例、城口县1例、丰都县5例、垫江县12例、忠县15例、云阳县18例、奉节县8例、巫山县6例、巫溪县11例、石柱县10例、秀山县1例、两江新区12例'
sdct['2020-02-03-00']='万州区49例、黔江区2例、涪陵区2例、渝中区9例、大渡口区6例、江北区16例、沙坪坝区2例、九龙坡区13例、南岸区6例、渝北区12例、巴南区2例、长寿区11例、江津区3例、合川区9例、永川区3例、綦江区5例、大足区5例、璧山区8例、铜梁区7例、潼南区3例、荣昌区4例、开州区17例、梁平区3例、武隆区1例、城口县1例、丰都县5例、垫江县12例、忠县15例、云阳县18例、奉节县9例、巫山县7例、巫溪县11例、石柱县10例、秀山县1例、两江新区12例、高新区1例'
sdct['2020-02-03-12']='万州区50例、黔江区2例、涪陵区2例、渝中区9例、大渡口区6例、江北区16例、沙坪坝区2例、九龙坡区13例、南岸区7例、渝北区12例、巴南区2例、长寿区11例、江津区3例、合川区9例、永川区3例、綦江区10例、大足区5例、璧山区8例、铜梁区7例、潼南区4例、荣昌区5例、开州区17例、梁平区3例、武隆区1例、城口县2例、丰都县5例、垫江县13例、忠县15例、云阳县18例、奉节县9例、巫山县7例、巫溪县11例、石柱县10例、秀山县1例、两江新区13例、高新区1例'
sdct['2020-02-04-00']=''
sdct['2020-02-04-12']=''
sdct['2020-02-05-00']=''
sdct['2020-02-05-12']=''

# Since 2020-02-04-00, the data in web is shown by Picture

city=[]
latest='2020-02-03-12'
for i in sdct[latest].split('、'):
    city.append(i[:2])

print('city of %s: '%province,city,'\n')    
print('number of infected cities now: ',len(city))

Table={}
for k,v in zip(sdct.keys(),sdct.values()):
    if len(v)<5:
        continue
    s=['0']*len(city)
    for i in v.split('、'):
        tmp=''
        for t in i:
            if t.isdigit():
                tmp+=t
            #tmp=int(tmp)
            s[city.index(i[:2])]=tmp
        Table[k]=s
    print(s)

### Output
print(province,',',','.join(city))
for date,out in zip(Table.keys(),Table.values()):
    print(date,',',','.join(out))
