### Project: 2020Wuhan@Github/Ginchung
## File: guangdong.py
## Run with 'python guangdong.py'

# object 'sdct'
# Function: stores the info from official message
# Key: YYYY-MM-DD-HH

province='guangdong'

sdct={}
sdct['2020-01-22-00']='广州2例、深圳14例、珠海4例、佛山1例、韶关2例、惠州1例、湛江2例'
sdct['2020-01-23-00']='广州5例、深圳15例、珠海4例、佛山1例、韶关2例、惠州1例、中山1例、湛江2例、肇庆1例'
sdct['2020-01-24-00']='广州7例、深圳15例、珠海8例、佛山6例、韶关3例、惠州5例、中山2例、阳江3例、湛江2例、肇庆1例、清远1例'
sdct['2020-01-25-00']='广州14例、深圳20例、珠海10例、汕头1例、佛山9例、韶关3例、惠州7例、东莞1例、中山2例、阳江5例、湛江2例、肇庆2例、清远2例'
sdct['2020-01-26-16']='广州17例、深圳31例、珠海12例、汕头2例、佛山10例、韶关4例、梅州1例、惠州8例、东莞2例、中山2例、阳江8例、湛江4例、肇庆4例、清远3例、揭阳3例'
sdct['2020-01-27-00']='广州39例、深圳36例、珠海12例、汕头2例、佛山14例、韶关4例、梅州1例、惠州8例、汕尾1例、东莞2例、中山4例、阳江8例、湛江5例、肇庆4例、清远3例、揭阳3例'
sdct['2020-01-27-12']='广州41例、深圳36例、珠海12例、汕头2例、佛山14例、韶关4例、梅州3例、惠州8例、汕尾1例、东莞2例、中山5例、阳江8例、湛江5例、肇庆4例、清远3例、揭阳3例'
sdct['2020-01-28-00']='广州市51例、深圳市49例、珠海市12例、汕头市5例、佛山市18例、韶关市4例、梅州市3例、惠州市11例、汕尾市1例、东莞市2例、中山市6例、阳江市8例、湛江市5例、肇庆市4例、清远市5例、揭阳市4例'
sdct['2020-01-28-12']='深圳市57例、广州市51例、佛山市18例、珠海市12例、惠州市11例、阳江市9例、湛江市7例、东莞市7例、中山市6例、清远市6例、汕头市5例、肇庆市4例、韶关市4例、揭阳市4例、梅州市4例、汕尾市1例、河源市1例'
sdct['2020-01-29-00']='广州市63例、深圳市63例、佛山市18例、珠海市14例、惠州市12例、中山市12例、阳江市10例、东莞市7例、湛江市7例、汕头市6例、清远市6例、揭阳市6例、肇庆市5例、韶关市4例、梅州市4例、茂名市2例、河源市1例、汕尾市1例'
sdct['2020-01-29-12']='广州市63例、深圳市80例、佛山市21例、珠海市18例、惠州市12例、中山市13例、江门市1例、阳江市10例、东莞市7例、湛江市9例、汕头市8例、清远市6例、揭阳市6例、肇庆市5例、韶关市4例、梅州市4例、茂名市3例、河源市1例、汕尾市1例'
sdct['2020-01-30-00']='深圳市86例、广州市79例、佛山市25例、珠海市18例、惠州市17例、中山市16例、汕头市12例、阳江市10例、湛江市9例、东莞市7例、清远市6例、揭阳市6例、肇庆市5例、梅州市5例、韶关市4例、茂名市3例、江门市1例、汕尾市1例、河源市1例'
sdct['2020-01-30-12']='广州市94例、深圳市98例、珠海市26例、汕头市12例、佛山市25例、韶关市4例、河源市1例、梅州市5例、惠州市17例、汕尾市1例、东莞市11例、中山市18例、江门市1例、阳江市10例、湛江市11例、茂名市3例、肇庆市5例、清远市6例、揭阳市6例'
sdct['2020-01-31-00']='广州市106例、深圳市110例、珠海市26例、汕头市12例、佛山市32例、韶关市4例、河源市1例、梅州市5例、惠州市17例、汕尾市3例、东莞市16例、中山市18例、江门市1例、阳江市10例、湛江市11例、茂名市3例、肇庆市6例、清远市6例、揭阳市6例'
sdct['2020-01-31-12']='广州市112例、深圳市134例、珠海市34例、汕头市12例、佛山市33例、韶关市4例、河源市1例、梅州市5例、惠州市20例、汕尾市3例、东莞市16例、中山市18例、江门市2例、阳江市10例、湛江市11例、茂名市3例、肇庆市6例、清远市6例、揭阳市6例'
sdct['2020-02-01-00']='深圳市170例、广州市137例、佛山市38例、珠海市38例、东莞市21例、惠州市20例、中山市18例、汕头市14例、湛江市13例、阳江市10例、清远市6例、揭阳市6例、肇庆市6例、梅州市5例、汕尾市4例、韶关市4例、潮州市3例、茂名市3例、江门市3例、河源市1例'
sdct['2020-02-01-12']='深圳市170例、广州市150例、佛山市39例、珠海市38例、东莞市21例、惠州市20例、中山市18例、汕头市14例、湛江市13例、阳江市10例、肇庆市6例、清远市6例、梅州市6例、揭阳市6例、韶关市4例、汕尾市4例、茂名市3例、江门市3例、潮州市3例、河源市1例'
sdct['2020-02-02-00']='深圳市196例、广州市175例、珠海市41例、佛山市39例、东莞市27例、惠州市23例、中山市21例、湛江市14例、汕头市14例、阳江市10例、肇庆市7例、清远市6例、梅州市6例、揭阳市6例、韶关市5例、汕尾市4例、茂名市3例、江门市3例、潮州市3例、河源市1例'
sdct['2020-02-02-12']=''

city=[]
latest='2020-02-02-00'
for i in sdct[latest].split('、'):
    city.append(i[:2])

print('city of %s: '%province,city,'\n')    
print('number of infected cities now: ',len(city))

Table={}
for k,v in zip(sdct.keys(),sdct.values()):
    if len(v)<5:
        continue
    s=['0']*len(city)
    for i in v.split('、'):
        tmp=''
        for t in i:
            if t.isdigit():
                tmp+=t
            #tmp=int(tmp)
            s[city.index(i[:2])]=tmp
        Table[k]=s
    print(s)

### Output
print(province,',',','.join(city))
for date,out in zip(Table.keys(),Table.values()):
    print(date,',',','.join(out))
